package com.green.day11.ch15;

public class ObjectRelation {
    /*
    객체간의 관계
    1) is - a : 상속으로 처리
    2) has - a : 멤버필드로 처리

    ex) 모바일폰, 스마트폰의 관계
    - "모바일폰은 스마트폰이다." --> 어색하지 않으면 is - a 관계
    - "바바리안은 캐릭터이다." --> is - a 관계

    ex) 스피커, 자동차의 관계
    - "자동차는 스피커이다."(x) --> is -a 관계(x)
    - "자동차에는 스피커가 있다.(자동차가 스피커를 가지고있다.)" --> has - a 관계
    - "바바리안은 도끼이다."(x)
    - "바바리안은 도끼를 무기로 사용한다." --> has - a 관계

    is - a , has - a로 처리할지는 온전히 개발자한테 달려있다. 관리가 유리한대로 하면된다.
    보통 말로 만들었을 때 어색하지 않은 문장의 관계를 설정하지만 100%는 아니다.
     */
}